In [39]:
import pandas as pd

# Sample DataFrame
data = {
    'EmployeeID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'Department': ['Sales', 'HR', 'IT', 'Sales', 'IT', 'HR', 'Sales', 'IT', 'HR', 'Sales'],
    'City': ['New York', 'Los Angeles', 'Chicago', 'New York', 'Chicago', 'Los Angeles', 'New York', 'Chicago', 'Los Angeles', 'New York'],
    'Salary': [70000, 80000, 90000, 75000, 85000, 82000, 72000, 88000, 81000, 74000],
    'JoiningDate': pd.to_datetime(['2020-05-20', '2019-03-15', '2021-07-10', '2020-11-11', '2018-06-23', '2021-09-12', '2019-08-01', '2020-02-14', '2021-01-10', '2020-12-03']),
    'PerformanceScore': [85, 78, 92, 88, 90, 79, 82, 95, 77, 83]
}

df = pd.DataFrame(data)

In [41]:
df.head()

   EmployeeID Department         City  Salary JoiningDate  PerformanceScore
0         101      Sales     New York   70000  2020-05-20                85
1         102         HR  Los Angeles   80000  2019-03-15                78
2         103         IT      Chicago   90000  2021-07-10                92
3         104      Sales     New York   75000  2020-11-11                88
4         105         IT      Chicago   85000  2018-06-23                90

In [51]:
df.groupby('Department')['Salary'].sum()

Department
HR       243000
IT       263000
Sales    291000
Name: Salary, dtype: int64

In [53]:
df.groupby('Department')['Salary'].mean()

Department
HR       81000.000000
IT       87666.666667
Sales    72750.000000
Name: Salary, dtype: float64

In [55]:
df.groupby('City')['PerformanceScore'].sum()

City
Chicago        277
Los Angeles    234
New York       338
Name: PerformanceScore, dtype: int64

In [57]:
df.groupby('Department').agg({'Salary' : 'mean'})

                  Salary
Department
HR          81000.000000
IT          87666.666667
Sales       72750.000000

In [59]:
df.groupby('City').agg({'Salary' : 'sum'})

             Salary
City
Chicago      263000
Los Angeles  243000
New York     291000

## Window Functions Practice

In [62]:
import pandas as pd

# Sample Data
data = {
    'EmployeeID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'Department': ['Sales', 'Sales', 'IT', 'IT', 'HR', 'HR', 'Sales', 'IT', 'HR', 'Sales'],
    'City': ['New York', 'New York', 'Chicago', 'Chicago', 'Los Angeles', 'Los Angeles', 'New York', 'Chicago', 'Los Angeles', 'New York'],
    'Salary': [70000, 72000, 90000, 88000, 82000, 81000, 75000, 85000, 83000, 74000],
    'JoiningDate': pd.to_datetime(['2021-01-15', '2021-03-20', '2021-05-10', '2021-07-25', '2021-09-15',
                                    '2021-11-05', '2021-02-10', '2021-04-18', '2021-06-22', '2021-08-01']),
    'PerformanceScore': [85, 88, 90, 92, 78, 79, 86, 87, 80, 84]
}

df = pd.DataFrame(data)

In [64]:
df.head()

   EmployeeID Department         City  Salary JoiningDate  PerformanceScore
0         101      Sales     New York   70000  2021-01-15                85
1         102      Sales     New York   72000  2021-03-20                88
2         103         IT      Chicago   90000  2021-05-10                90
3         104         IT      Chicago   88000  2021-07-25                92
4         105         HR  Los Angeles   82000  2021-09-15                78

In [66]:
df['Salary'].cumsum()

0     70000
1    142000
2    232000
3    320000
4    402000
5    483000
6    558000
7    643000
8    726000
9    800000
Name: Salary, dtype: int64

In [68]:
df.groupby('Department')['PerformanceScore'].cumsum()

0     85
1    173
2     90
3    182
4     78
5    157
6    259
7    269
8    237
9    343
Name: PerformanceScore, dtype: int64

In [70]:
df.head()

   EmployeeID Department         City  Salary JoiningDate  PerformanceScore
0         101      Sales     New York   70000  2021-01-15                85
1         102      Sales     New York   72000  2021-03-20                88
2         103         IT      Chicago   90000  2021-05-10                90
3         104         IT      Chicago   88000  2021-07-25                92
4         105         HR  Los Angeles   82000  2021-09-15                78

In [82]:
# Ranking salaries within departments:

df.groupby('Department')['Salary'].rank(ascending = False, method = 'dense')

0    4.0
1    3.0
2    1.0
3    2.0
4    2.0
5    3.0
6    1.0
7    3.0
8    1.0
9    2.0
Name: Salary, dtype: float64

In [106]:
# Row number for employees in each department:

df.groupby('Department')['EmployeeID'].cumcount() + 1

0    1
1    2
2    1
3    2
4    1
5    2
6    3
7    3
8    3
9    4
dtype: int64

In [124]:
df.groupby('Department')['EmployeeID'].rank(method = 'min')

0    1.0
1    2.0
2    1.0
3    2.0
4    1.0
5    2.0
6    3.0
7    3.0
8    3.0
9    4.0
Name: EmployeeID, dtype: float64